raya/common/models/DetailesForm.php

SELECT * FROM `detailes_form`
---
    static public function getDetails()
    {
        $result = self::find()
            ->one();