raya/common/models/Enumeration.php

    public static function getParentEnumByType( $show = self::NOT_SHOW_IN_LIST , $isArray = false )
    {
        $result = self::find()
            ->select('id , title')
            ->where(['status'   => self::STATUS_ACTIVE])
            ->andWhere(['show'  => $show])
            ->orderBy('id')
            ->all();
---
SELECT `id`, `title` FROM `enumeration` WHERE (`status`=1) AND (`show`=0) ORDER BY `id`