raya/backend/modules/formBuilder/models/DetailesForm.php

SELECT * FROM `detailes_form` ORDER BY `id` DESC LIMIT 1
---
    static public function getItems()
    {
        $result = self::find()
            ->orderBy('id DESC')
            ->limit(1)
            ->one();