raya/backend/modules/formBuilder/models/Enumeration.php

SELECT `id`, `title` FROM `enumeration` WHERE (`status`=1) AND (`show`=1) AND (`type`='_csrf-backend') ORDER BY `id`
---
    public static function getEnumListByType( $type, $show = self::SHOW_IN_LIST)
    {
        $result = [];
            $result = self::find()
                ->select('id , title')
                ->where(['status'   => self::STATUS_ACTIVE])
                ->andWhere(['show'  => $show])
                ->andWhere(['type' => $type])
                ->orderBy('id')
                ->all();

SELECT `title` FROM `enumeration` WHERE `id`='4'
---
    public static function getEnumTitileById($enumertionId)
    {
        $result = self::find()
            ->select('title')
            ->andWhere(['id' => $enumertionId])
            ->one();