raya/backend/modules/formBuilder/models/UserInfo.php

INSERT INTO `user_info` (`name`, `last_name`, `creation_date`, `detailes_item`, `status`) VALUES ('cccc', 'ccc', 1610520658, '{\"personalcode\":\"4444\",\"nationalcode\":\"4444\",\"grade\":\"3\",\"state\":\"7\"}', 1)
UPDATE `user_info` SET `creation_date`=1610520663 WHERE `id`=85
---

        $transaction = Yii::$app->db->beginTransaction();
        try {
            if (!$model->save(false))

SELECT * FROM `user_info` WHERE `id`='84'
---
    static public function getUserInfoById($id)
    {
        $result = self::find()
            ->where(['id' => $id])
            ->one();